# RestoreCalloutParent Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..RestoreCalloutParent Method
View Class See Also
---
Restores callout parent ID to the original view ID if that view is still available.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void RestoreCalloutParent()
```

Visual Basic
---
```text
Public Sub RestoreCalloutParent
```

Visual C++
---
```text
public:
void RestoreCalloutParent()
```

# Remarks
Nothing is done if the callout already has parent or if the original callout parent is deleted or is not parallel to the callout view.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This view is not a callout. |

# See Also
View Class
Autodesk.Revit.DB Namespace